import Mathlib.Tactic

/-!
# Analysis I, раздел 2.1: Аксиомы Пеано

Этот файл — перевод раздела 2.1 книги Analysis I на Lean 4. Вся нумерация ссылается на
оригинальный текст.

Я старался сделать перевод максимально точным перефразированием оригинального текста. Когда
приходилось выбирать между более идиоматичным Lean-решением и более точным переводом, я, как
правило, выбирал второе. В частности, местами Lean-код можно было бы "заголфить", сделав его более
элегантным и идиоматичным, но я сознательно этого избегал.

Основные конструкции и результаты этого раздела:

- Определение натуральных чисел "Главы 2", `Chapter2.Nat`, сокращённо {name}`Nat` в
  пространстве имён Chapter2. (В книге натуральные числа рассматриваются чисто аксиоматически,
  как тип, подчиняющийся аксиомам Пеано; но здесь мы пользуемся встроенными индуктивными типами
  Lean, чтобы явно построить версию натуральных чисел, удовлетворяющую этим аксиомам. Можно было
  бы действовать и более аксиоматически, как это сделано в разделе 3 для теории множеств:
  см. эпилог этой главы.)
- Установление аксиом Пеано для `Chapter2.Nat`.
- Рекурсивные определения для `Chapter2.Nat`.

Замечание: в конце этой главы класс `Chapter2.Nat` будет вытеснен стандартным классом Mathlib
{name}`_root_.Nat`, или {lean}`ℕ`. Тем не менее, в следующих нескольких разделах мы разработаем
свойства `Chapter2.Nat` "вручную" в педагогических целях.

-/

namespace Chapter2

/-
Это лишь предположение о существовании натуральной числовой системы ℕ.
Оно будет уточняться после введения понятий "множество" и "функция".

Т.е. просто из определения такого типа Nat ещё не следует то, что он
годится для определения натуральной числовой системы.
-/

/--
  Assumption 2.6 (Existence of natural numbers). Here we use an explicit construction of the
  natural numbers (using an inductive type). For a more axiomatic approach, see the epilogue to
  this chapter.
-/
inductive Nat where
| zero : Nat
| succ : Nat → Nat
deriving Repr, DecidableEq  -- это позволяет тактике `decide` работать с `Nat`

-- Постулируем разрешимость равенства натуральных чисел.

-- Пропозициональное равенство разрешимо для всех элементов типа.
-- Другими словами, экземпляр DecidableEq α — это способ
-- решить утверждение a = b для всех a b : α.

/-- Axiom 2.1 (0 является натуральным числом) -/
instance Nat.instZero : Zero Nat := ⟨ zero ⟩
#check (0 : Nat)

/-- Axiom 2.2 (последователь натурального числа — тоже натуральное число) -/
postfix:100 "++" => Nat.succ
#check (fun n ↦ n++)
-- #check ((fun n ↦ n++) 0 : Nat)

#check ((0++)++ : Nat)

-- Единственная операция, которая у нас есть - операция увеличения на единицу.
-- Мы не говорим, что это такое за операция, и чем вообще являются натуральные числа.
-- Это типа философские вопросы. Для нас имеет значение только какие свойства имеют объекты,
-- а не то, что они из себя представляют и что означают.
--
-- Совсем не обязательно для построения натуральных чисел использовать тип, вроде
-- определённого выше Nat. Можно использовать и другие объекты, например множества и
-- понятие об их мощности. Идея в том, что все возможные натуральные числовые системы,
-- построенные из разных математических объектов/структур должны подчиняться всем
-- необходимым аксиомам и допускать необходимые действие.
-- Короче - первична аксиоматическая система, а не выбранный объект/структура.
-- Вообще, одно из великих открытий 19 века в том, что числа можно понимать абстрактно,
-- через аксиомы, не нуждаясь в конкретной модели.

/-- Definition 2.1.3 (определение числительных 0, 1, 2 и т.д.). Замечание: во избежание
  неоднозначности иногда может понадобиться явное приведение типов, например {lean}`(0 : Nat)`,
  {lean}`(1 : Nat)` и т.д., чтобы сослаться именно на версию натуральных чисел из этой главы. -/
instance Nat.instOfNat {n : _root_.Nat} : OfNat Nat n where
  ofNat := _root_.Nat.rec 0 (fun _ n ↦ n++) n

instance Nat.instOne : One Nat := ⟨ 1 ⟩

lemma Nat.zero_succ : 0++ = 1 := by rfl
#check (1 : Nat)

lemma Nat.one_succ : 1++ = 2 := by rfl
#check (2 : Nat)

/-- Proposition 2.1.4 (3 is a natural number) -/
lemma Nat.two_succ : 2++ = 3 := by rfl
#check (3 : Nat)

/--
  Axiom 2.3 (0 не является последователем никакого натурального числа).
  Сравните со встроенной {name}`Nat.succ_ne_zero` в Lean.
-/
theorem Nat.succ_ne (n : Nat) : n++ ≠ 0 := by
  by_contra h
  -- Тактика injection умеет обнаруживать противоречия в контексте.
  injection h

/-
  Под капотом для каждого индуктивного типа в Lean автоматически генерируется теорема
  `noConfusion`. Автоматически сгенерированная, примерно такая:

  Nat.noConfusion : n++ = zero → False

  Когда injection видит h : n++ = zero, она распознаёт это как несовпадение конструкторов.
  После этого она:

  - Находит автоматически сгенерированный принцип "no-confusion" для `Nat`
  - Применяет его к `h`, что сразу же даёт `False`
  - Цель `False` замыкается, доказательство завершено
-/

-- По определению тоже самое, что и Nat.succ_ne_zero

/-- Proposition 2.1.6 (4 не равно нулю) -/
theorem Nat.four_ne : (4 : Nat) ≠ 0 := by
  -- По определению 4 = 3++.
  change 3++ ≠ 0
  -- По аксиоме 2.3, 3++ не равно нулю.
  exact succ_ne _

/-
Идея в том, чтобы начать с минимального набора аксиом.
Рассматривать различные конкретные примеры систем, построенных на
этой аксиоматической базе и врубаться насколько они противоречат
интуитивным представлениям. Если противоречат, то добавлять
минимально необходимые аксиомы, чтобы "залатать" косяки.
-/

/--
  Axiom 2.4 (разные натуральные числа имеют разных последователей).
  Сравните с {name}`Nat.succ_inj` из Mathlib.
-/
theorem Nat.succ_cancel {n m : Nat} (hnm : n++ = m++) : n = m := by
  injection hnm

-- ^ Это следствие того, что ниже по закону контрапозиции:
-- https://ru.wikipedia.org/wiki/%D0%97%D0%B0%D0%BA%D0%BE%D0%BD_%D0%BA%D0%BE%D0%BD%D1%82%D1%80%D0%B0%D0%BF%D0%BE%D0%B7%D0%B8%D1%86%D0%B8%D0%B8

/--
  Axiom 2.4 (разные натуральные числа имеют разных последователей).
  Сравните с {name}`Nat.succ_ne_succ` из Mathlib.
-/
theorem Nat.succ_ne_succ (n m : Nat) : n ≠ m → n++ ≠ m++ := by
  intro h
  -- Закон контрапозиции позволяет нам доказывать отрицание посылки, что проще.
  contrapose! h
  have := succ_cancel h -- по аксиоме 2.4
  exact this

/-- Example 2.1.7 (a) -/
example : 4++ ≠ 4 := by
  -- Такие утверждения проще доказывать через противоречие
  by_contra h
  -- Будем разворачивать определение числа в succ (++)
  -- и снимать слой за слоем
  change 4++ = 3++ at h
  apply Nat.succ_cancel at h
  change 3++ = 2++ at h
  apply Nat.succ_cancel at h
  change 2++ = 1++ at h
  apply Nat.succ_cancel at h
  change 1++ = 0++ at h
  apply Nat.succ_cancel at h
  change 0++ = 0 at h
  have := Nat.succ_ne 0
  contradiction

-- Или, если сократить с помощью repeat
example : 4++ ≠ 4 := by
  by_contra h
  -- Здесь шаблон (_)++ = (_)++ матчится с такими выражениями: (3++)++ = 3++
  repeat (change _++ = _++ at h; apply Nat.succ_cancel at h)
  have := Nat.succ_ne 0
  contradiction

/-- Example 2.1.7 (b) -/
-- Тоже самое для второго контрпримера из книги
example : 4++ ≠ 1 := by
  by_contra h
  change 4++ = 0++ at h
  apply Nat.succ_cancel at h
  change 3++ = 0 at h
  have := Nat.succ_ne 3
  contradiction

/-- Proposition 2.1.8 (6 не равно 2) -/
theorem Nat.six_ne_two : (6 : Nat) ≠ 2 := by
-- это доказательство написано так, чтобы следовать структуре оригинального текста.
  by_contra h
  change 5++ = 1++ at h
  apply succ_cancel at h
  change 4++ = 0++ at h
  apply succ_cancel at h
  have := four_ne
  contradiction

/-- Такой результат можно доказать и с помощью тактики {tactic}`decide` -/
theorem Nat.six_ne_two' : (6 : Nat) ≠ 2 := by
  decide

/-
Пока что всё ещё можно построить нат. числовую систему типа такой:
ℕ := {0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, ...}
Мы хотим исключить "неправильные" числа. Поэтому нам нужен какой-то способ
определять последовательности рекурсивно. Какая-то такая схема должна быть,
с помощью которой можно сказать, что существуют числа только определённого вида,
сконструированные только вот этим одним конкретным способом
(прибавлением едниницы в нашем случае).

Нужна аксиома, согласно которой все числа в ℕ могут быть получены из
нуля и операции добавления единицы, чтобы исключить любые другие элементы (типа 0.5).

И вот под "могут быть получены из" мы будем понимать принцип мат. индукции.
Это и будет нашей пятой аксиомой.
-/

/-- Axiom 2.5 (принцип математической индукции). Тактика {tactic}`induction` (или
  {tactic}`induction'`) из Mathlib служит заменой этой аксиоме. -/
theorem Nat.induction (P : Nat → Prop) (hbase : P 0) (hind : ∀ n, P n → P (n++)) : ∀ n, P n := by
  intro n
  induction n with
  | zero => exact hbase
  | succ n hi => exact hind n hi

/-
Мы хотим построить последовательность вида {a₀, a₁, a₂, ...}. Суть в том,
что мы хотим сделать возможным переход от одного элемента последовательности к другому
только с помощью какой-то одной функции (у нас это операция прибавления единицы).

Используя мат. индукцию мы можем убедиться, что такая последовательность может
быть построена только одним способом, в котором переход от некоторого
предыдущего элемента aₙ к следующему aₙ++ возможен только с помощью функции fₙ:
aₙ++ := fₙ(aₙ). У нас каждая из этих функций, это операция добавления единицы (++).

c = a₀ -(f₀)→ a₁ -(f₁)→ a₂ ... aₙ -(fₙ)→ aₙ++
a₀ := c
a₁ := f₀(a₀)
a₂ := f₁(a₁)
...
aₙ++ := fₙ(aₙ)
-/

/-
Утверждение 2.1.16 (рекурсивные определения):

Для каждого n ∈ ℕ существует некоторая ф-ция fₙ : ℕ → ℕ,
которая сопоставляет этому n какое-то натуральное число.
Пусть c ∈ ℕ, тогда каждого n ∈ ℕ существует уникальное aₙ такое,
что a₀ = c и aₙ++ = f(aₙ).

Проще говоря: a₀ = c ∧ ∀ n ∈ ℕ, aₙ++ = fₙ(aₙ)

В книге написано, что мы каждому натуральному числу n сопоставляем
такую функцию перехода fₙ : ℕ → ℕ, но ведь операция у нас только одна - ++.
Поэтому имхо можно дать упрощённое определение вроде:

a₀ -(++)→ a₁ -(++)→ a₂ ... aₙ -(++)→ aₙ++
aₙ++ := (aₙ)++

Оринальное определение как будто бы позволяет иметь для каждого перехода от
одного элемента последовательности к другому какую-то свою уникальную операцию.
Т.е., например, пусть, чисто ради прикола
f₀ := (++)  - операция "прибавления" единицы
f₁ := (+++) - операция "добавления" едницицы
итд
-/

-- Вместе с индуктивным типом всегда автоматически определяется
-- принцип элиминации rec. Эту функцию также называют рекурсором,
-- и именно она делает тип индуктивным: онa позволяет определить функцию на
-- твоём индуктивном типе, присваивая значения, соответствующие каждому конструктору.
-- Интуитивно, индуктивный тип исчерпывающе порождается своими конструкторами и
-- не имеет элементов, кроме тех, которые они создают.
--
-- Вот ниже показано как раз как она выглядит для наших натуральных чисел.

/--
  Рекурсия. Аналог встроенного метода Mathlib {name}`Nat.rec`, связанного
  с натуральными числами Mathlib
-/
abbrev Nat.recurse (f : Nat → Nat → Nat) (c : Nat) : Nat → Nat :=
  fun n ↦
    match n with
    | 0 => c
    | n++ => f n (recurse f c n)

-- Сравни c:
#check Nat.rec

/- Тут Nat.recurse это схема определения числовой последовательности рекурсивным способом.
   abbrev по сути эквивалентно def.

   Для каждого n ∈ ℕ она конструирует ф-цию fₙ : ℕ → ℕ, которая
   сопоставляет этому n какое-то натуральное число.

   c ∈ N - то, что она вернёт для n = 0
   f - ф-ция, которая для данного n ∈ ℕ и aₙ возвращает fₙ(aₙ),

       Во второй ветке сопоставления с образцом, чтобы получить aₙ, она рекурсивно
       вызывает сама себя (recurse f c n),
       где с n как бы "снимется" ещё одна единичка и "перекидывается наружу" и
       так до нуля (0 => c). Короче, она делает вот это: aₙ++ = fₙ(aₙ).

       Второй параметр, который мы передаём в f это предыдущее число,
       (которое мы должны сконструировать).

   Итак, используя аксиомы 2.1 и 2.2 мы можем конструировать числа.
   Благодаря аксиоме 2.3 мы знаем, что мы не зациклим такую числовую систему в 0.
   Аксиома 2.4 не допускает переопределение чисел.
   Ну а с помощью 2.5 мы можем определить нашу последовательность единственным способом
   (путём перехода между элементами только с помощью операции прибавления единички) и
   таким образом исключить "лишние числа" (вроде 0.5, 0.333...).
-/

/-- Proposition 2.1.16 (рекурсивные определения). Сравните с {name}`Nat.rec_zero` из Mathlib. -/
theorem Nat.recurse_zero (f : Nat → Nat → Nat) (c : Nat) : Nat.recurse f c 0 = c := by rfl
-- ^ c - нулевой эл. числ. посл. или
--   Nat.recurse натуральному числу 0 сопоставляет число c
--   По сути это базовый случай сопоставления с образцом в определении `Nat.recurse`.
-- Такое равенство доказывается одной редукцией Nat.recurse f c 0.

/-- Proposition 2.1.16 (рекурсивные определения). Сравните с {name}`Nat.rec_add_one` из Mathlib. -/
theorem Nat.recurse_succ (f : Nat → Nat → Nat) (c : Nat) (n : Nat) : 
    recurse f c (n++) = f n (recurse f c n) := by rfl
-- ^ Это второй случай сопоставления с образцом в определении `Nat.recurse`.
-- Тоже доказывается одной редукцией Nat.recurse.

/-- Proposition 2.1.16 (рекурсивные определения). -/
theorem Nat.eq_recurse
        (f : Nat → Nat → Nat)
        (c : Nat)
        (a : Nat → Nat) :
        (a 0 = c ∧ ∀ n, a (n++) = f n (a n)) ↔ (a = recurse f c) := by
  constructor
  . intro ⟨h0, hsucc⟩
    -- это доказательство написано так, чтобы следовать структуре оригинального текста.
    apply funext
    apply induction
    . exact h0
    · intro n ih
      rw [hsucc n]
      rw [recurse_succ]
      rw [ih]
  · intro h
    rw [h]
    constructor -- также можно использовать `split_ands` или `and_intros`
    . exact recurse_zero _ _
    · exact recurse_succ _ _


/-- Proposition 2.1.16 (рекурсивные определения). -/
theorem Nat.recurse_uniq (f : Nat → Nat → Nat) (c : Nat) :
    ∃! (a : Nat → Nat), a 0 = c ∧ ∀ n, a (n++) = f n (a n) := by
  apply ExistsUnique.intro (recurse f c)
  . constructor -- также можно использовать `split_ands` или `and_intros`
    . exact recurse_zero _ _
    . exact recurse_succ _ _
  intro a
  exact (eq_recurse _ _ a).mp

/-
Наше определение натуральных чисел — аксиоматическое, а не конструктивное.
Мы не говорим, что такое натуральные числа (поэтому мы не отвечаем на вопросы вроде
«из чего они сделаны», «физические ли это объекты», «что они измеряют» и т.п.) —
мы просто перечислили некоторые действия, которые с ними можно делать
(на самом деле единственная операция, которую мы пока определили, — это увеличение на единицу), а
также некоторые их свойства. Так и работает математика — она рассматривает свои объекты абстрактно,
заботясь только о том, какими свойствами эти объекты обладают, а не о том,
чем они являются или что означают.  Неважно, означает ли натуральное число определённое
расположение косточек на счётах, или определённую организацию битов в памяти компьютера, или
ещё какой-то более абстрактный концепт без физического носителя; пока вы можете их увеличивать,
проверять, равны ли два из них, а позже выполнять другие арифметические действия вроде
сложения и умножения — они годятся в качестве чисел для математических целей
(разумеется, при условии, что подчиняются нужным аксиомам). Натуральные числа можно
сконструировать из других математических объектов — например, из множеств, — но
существует несколько способов построить рабочую модель натуральных чисел, и спорить о том,
какая модель «истинная», с точки зрения математика по крайней мере бессмысленно:
пока модель удовлетворяет всем аксиомам и делает всё как надо, этого достаточно.
-/

/-
Исторически осознание того, что числа можно изучать аксиоматически, появилось совсем недавно —
чуть больше ста лет назад. Раньше числа обычно жёстко привязывали к чему-то внешнему:
к количеству элементов в множестве, к длине отрезка, к массе физического объекта и так далее.
Это более-менее работало, пока не приходилось переходить от одной числовой системы к другой.
Например, представлять числа как счётные шарики — отлично для чисел 3 и 5, но
плохо подходит для −3, 1/3, √2 или 3+4i.  Поэтому каждый крупный шаг в теории чисел
(отрицательные числа, иррациональные числа, комплексные числа, даже ноль) вызывал много
ненужных философских терзаний. Великое открытие конца XIX века в том, что числа можно
понимать абстрактно, через аксиомы, не требуя обязательной конкретной модели.
Конечно, математик может использовать любую из таких моделей, когда это удобно —
для интуиции и понимания, — но их же можно без сожаления отбросить, если они начинают мешать.
-/

end Chapter2
